<template>
  <div class="container">
    <div class="left-aligned">
      <h2>TG МАСТЕР</h2>
      <h3>Лучшие инструменты по генерации прибыли в Телеграм, которые позволяют привлечь к вашему продукту или услуге целевую аудиторию </h3>
    </div>

    <div class="center-aligned">
      <div class="column" id="column1">
        <svg xmlns="http://www.w3.org/2000/svg" width="40" height="40" viewBox="0 0 24 24">
          <path fill="#FFC000" d="M7.4 17.25q-1.05.875-2.187.8t-1.988-.775t-1.162-1.837t.412-2.338L4.35 10q-.625-.55-.987-1.325T3 7q0-1.65 1.175-2.825T7 3t2.825 1.175T11 7T9.825 9.825T7 11q-.225 0-.45-.025t-.425-.075L4.2 14.15q-.275.45-.175.888t.425.712t.775.313t.875-.313l10.5-9.025q1.05-.875 2.2-.788t2 .788t1.15 1.838t-.425 2.337L19.65 14q.625.55.988 1.325T21 17q0 1.65-1.175 2.825T17 21t-2.825-1.175T13 17t1.175-2.825T17 13q.225 0 .438.025t.412.075l1.95-3.25q.275-.45.175-.888t-.425-.712t-.775-.312t-.875.312z"/>
        </svg>
        <h2>Автоматизация рутинных процессов</h2>
      </div>
      <div class="column" id="column2">
        <svg xmlns="http://www.w3.org/2000/svg" width="40" height="40" viewBox="0 0 2048 2048">
          <path fill="#FFC000" d="M1024.022 99.36c-19.324-.017-38.646 7.15-52.98 21.55L120.937 971.023c-28.67 28.668-28.537 77.295.132 105.963l849.971 849.965c28.67 28.678 77.294 28.804 105.963 0l850.106-850.1c28.669-28.667 28.536-77.296-.135-105.964L1077.002 120.91c-14.334-14.334-33.657-21.534-52.98-21.55zm-.065 126.045l798.66 798.666l-798.66 798.657l-798.66-798.657l798.66-798.666zm-18.879 392.361l-.002.416c0 .01-8.367 1.55-8.37 1.55c-.01 0-6.853 4.644-6.858 4.644c-.01 0-4.764 7.062-4.768 7.062c0 .01-1.61 8.418-1.613 8.418V926.1l-202.64-202.64h.01c-.01 0-7.197-4.644-7.2-4.644c-.012 0-8.017-1.627-8.078-1.638c-.078.012-8.315 1.543-8.319 1.543c-.01-.01-7.065 4.74-7.068 4.74l-26.633 26.617l-4.861 7.16c-.01 0-1.504 8.223-1.504 8.223c0 .01 1.614 8.127 1.615 8.127c0 .01 4.613 7.16 4.615 7.16l202.54 202.543H639.486l-.056-.068c0 .01-8.332 1.837-8.336 1.837c-.01.01-6.851 4.645-6.856 4.645v-.049c-.01.01-4.763 7.065-4.767 7.065c-.01 0-1.612 8.416-1.615 8.416v37.666s1.6 8.515 1.658 8.515c0 .02 4.745 6.87 4.746 6.87c.01 0 6.894 4.644 6.896 4.644c.01.02 8.368 1.838 8.371 1.838h286.36L723.52 1267.036v-.076c-.01.01-4.86 7.16-4.862 7.16c-.01.01-1.506 8.223-1.506 8.223c0 .019 1.617 8.127 1.618 8.127c0 0 4.63 7.16 4.615 7.16l26.637 26.617c.01.01 7.278 4.74 7.28 4.74l8.108 1.645c.012 0 8.213-1.547 8.217-1.547c0 0 7.171-4.838 7.174-4.838l202.668-202.668v286.861l-.053-.056c0 .01 1.66 8.513 1.658 8.513c0 .01 4.745 6.87 4.745 6.87c.01.01 6.894 4.644 6.896 4.644c0 0 8.309 1.741 8.371 1.838l37.654-.01c.01 0 8.532-1.74 8.537-1.74c0 0 6.851-4.645 6.856-4.645c.01-.01 4.741-6.869 4.746-6.869c0 0 1.633-8.515 1.637-8.515v-286.698l202.523 202.514c-.01.02 7.276 4.74 7.28 4.74c.01.01 8.106 1.55 8.109 1.55c.012 0 8.212-1.55 8.217-1.55c0 0 7.17-4.838 7.176-4.838l26.625-26.634c.01 0 4.719-7.065 4.779-7.065c0-.02 1.64-8.32 1.6-8.416c0-.01-1.618-8.129-1.62-8.129c-.012.01-4.713-7.256-4.775-7.256l-202.016-202.029h285.957c.01.01 8.532-1.742 8.535-1.742c.01 0 6.853-4.645 6.856-4.645c.01-.019 4.74-6.869 4.746-6.869c0 0 1.633-8.513 1.637-8.513v-37.657c0-.01-1.626-8.32-1.623-8.418c-.01-.02-4.72-7.063-4.72-7.063c-.01-.01-6.895-4.644-6.897-4.644c0 .01-8.532-1.645-8.534-1.645l-37.66-.01zm-239.52 99.41l.034-.005h-.063l.03.006z"/>
        </svg>
        <h2>Комплексный подход</h2>
      </div>
      <div class="column" id="column3">
        <svg xmlns="http://www.w3.org/2000/svg" width="40" height="40" viewBox="0 0 24 24">
          <path fill="#FFC000" d="M12 22q-2.075 0-3.9-.788t-3.175-2.137q-1.35-1.35-2.137-3.175T2 12q0-2.075.788-3.9t2.137-3.175q1.35-1.35 3.175-2.137T12 2q2.075 0 3.9.788t3.175 2.137q1.35 1.35 2.138 3.175T22 12q0 2.075-.788 3.9t-2.137 3.175q-1.35 1.35-3.175 2.138T12 22Zm-2.9-2.55l1.2-2.75q-1.05-.375-1.813-1.162T7.3 13.7l-2.75 1.15q.575 1.6 1.775 2.8t2.775 1.8ZM7.3 10.3q.425-1.05 1.188-1.837T10.3 7.3L9.15 4.55q-1.6.6-2.8 1.8t-1.8 2.8L7.3 10.3ZM12 15q1.25 0 2.125-.875T15 12q0-1.25-.875-2.125T12 9q-1.25 0-2.125.875T9 12q0 1.25.875 2.125T12 15Zm2.9 4.45q1.575-.6 2.763-1.787T19.45 14.9l-2.75-1.2q-.375 1.05-1.15 1.813t-1.8 1.187l1.15 2.75Zm1.8-9.2l2.75-1.15q-.6-1.575-1.788-2.762T14.9 4.55l-1.15 2.8q1.025.375 1.775 1.137T16.7 10.25Z"/>
        </svg>
        <h2>Полное сопровождение</h2>
      </div>
      <div class="column" id="column4">
        <svg xmlns="http://www.w3.org/2000/svg" width="40" height="40" viewBox="0 0 24 24">
          <path fill="#FFC000" d="M11.298 2.195a2 2 0 0 1 1.232-.055l.172.055l7 2.625a2 2 0 0 1 1.291 1.708l.007.165v5.363a9 9 0 0 1-4.709 7.911l-.266.139l-3.354 1.677a1.5 1.5 0 0 1-1.198.062l-.144-.062l-3.354-1.677a9 9 0 0 1-4.97-7.75l-.005-.3V6.693a2 2 0 0 1 1.145-1.808l.153-.065l7-2.625Zm4.135 6.434l-4.598 4.598l-1.768-1.768a1 1 0 0 0-1.414 1.415l2.404 2.404a1.1 1.1 0 0 0 1.556 0l5.234-5.235a1 1 0 1 0-1.414-1.414Z"/>
        </svg>
        <h2>Безопасность</h2>
      </div>
    </div>
  </div>
</template>


<script>
export default {
  mounted() {
    const columns = document.querySelectorAll('.column');
    let index = 0;

    function showColumn() {
      if (index < columns.length) {
        columns[index].classList.add('show');
        index++;
        setTimeout(showColumn, 800); // Показывает каждый элемент через 800 мс
      }
    }

    showColumn();
  }
}

</script>

<style scoped>
.container {
  display: flex;
  flex-direction: column;
  align-items: center;
  padding: 20px;
  width: 100%;
  font-family: "Roboto Condensed", Helvetica, Arial, sans-serif;
  background-color: #131313;
  overflow-y: auto;
  overflow-x: hidden;
  box-sizing: border-box;
}

h2, h3, button {
  font-family: "Roboto Condensed", Helvetica, Arial, sans-serif;
}

h2 {
  font-size: 20px;
  color: #C4C3C3;
  font-weight: bold;
}

h3 {
  font-weight: 100;
  color: #e9e9e9;
}

.left-aligned {
  text-align: left;
  margin-bottom: 20px;
  margin-top: 20px;
  width: 70%;
}

.center-aligned {
  display: flex;
  flex-direction: column;
  align-items: center;
  text-align: center;
  width: 70%;
  height: 100%;
  margin-bottom: 30px;
  justify-content: space-between;
}

.column {
  display: flex;
  flex-direction: column;
  align-items: center;
  text-align: center;
  margin: 10px;
  width: 100%; /* Занимает всю ширину родителя */
  box-sizing: border-box; /* Чтобы отступы не влияли на общую ширину */
  opacity: 0; /* Изначально элементы скрыты */
  transform: scale(0.9); /* Небольшое уменьшение */
  transition: opacity 0.5s, transform 0.5s; /* Плавная анимация */
}

.column.show {
  opacity: 1;
  transform: scale(1); /* Увеличение при появлении */
}

.column svg {
  width: 70px;
  height: 70px;
  margin-bottom: 10px;
}
</style>
